<!-- terraform-plan-comment -->
# Terraform Plan Results

**4 change(s):** 2 to create, 2 to update, 0 to replace, 0 to destroy

**⚠️ Resources will be modified**

## Resources to create:
- `databricks_mws_permission_assignment.segment_storage`
- `databricks_service_principal.segment_storage`

## Resources to update:
- `databricks_grants.catalog_main`
- `databricks_permissions.sql_warehouse_starter`

<details>
<summary>Show diff</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # databricks_grants.catalog_main will be updated in-place
  ~ resource "databricks_grants" "catalog_main" {
        id      = "catalog/goodparty_data_catalog"
        # (1 unchanged attribute hidden)

      + grant {
          + principal  = (known after apply)
          + privileges = [
              + "CREATE_SCHEMA",
              + "CREATE_TABLE",
              + "SELECT",
              + "USE_CATALOG",
              + "USE_SCHEMA",
            ]
        }

        # (16 unchanged blocks hidden)
    }

  # databricks_mws_permission_assignment.segment_storage will be created
  + resource "databricks_mws_permission_assignment" "segment_storage" {
      + id           = (known after apply)
      + permissions  = [
          + "USER",
        ]
      + principal_id = (known after apply)
      + workspace_id = 3578414625112071
    }

  # databricks_permissions.sql_warehouse_starter will be updated in-place
  ~ resource "databricks_permissions" "sql_warehouse_starter" {
        id              = "/sql/warehouses/18583d8b081c6486"
        # (2 unchanged attributes hidden)

      - access_control {
          - permission_level       = "IS_OWNER" -> null
          - user_name              = "hugh@goodparty.org" -> null
            # (2 unchanged attributes hidden)
        }
      - access_control {
          - group_name             = "users" -> null
          - permission_level       = "CAN_USE" -> null
            # (2 unchanged attributes hidden)
        }
      + access_control {
          + permission_level       = "CAN_USE"
          + service_principal_name = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + access_control {
          + group_name             = "account users"
          + permission_level       = "CAN_USE"
            # (2 unchanged attributes hidden)
        }
    }

  # databricks_service_principal.segment_storage will be created
  + resource "databricks_service_principal" "segment_storage" {
      + acl_principal_id           = (known after apply)
      + active                     = true
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + application_id             = (known after apply)
      + databricks_sql_access      = false
      + display_name               = "segment_storage"
      + home                       = (known after apply)
      + id                         = (known after apply)
      + repos                      = (known after apply)
      + workspace_access           = false
      + workspace_consume          = false
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ astro_deployments    = {
      ~ dev  = {
            id            = "cml8n1tav1nxs01nd7ptp4tpm"
            name          = "astro-dev"
          ~ webserver_url = "cmgicqn2w002701mqfw3367w2.astronomer.run/dptp4tpm" -> "cml8n1tav1nxs01nd7ptp4tpm.pm.astronomer.run/dptp4tpm"
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged attribute hidden)
    }
```

</details>

---

<details>
<summary>What do these mean?</summary>

- **Create**: New resources will be added
- **Update**: Existing resources will be modified in-place
- **Replace**: Resources will be destroyed and recreated (data loss possible)
- **Destroy**: Resources will be permanently deleted

</details>

---

**To apply these changes:**

1. **Merge** this PR to `main`
2. **Review** the plan in the workflow run triggered by the merge
3. **Deploy** via Actions → Deploy → Run workflow → uncheck "Dry run"

Or via CLI after merge: `gh workflow run deploy.yaml -f dry_run=false`
